# RbsParallelpipesVerticalNumber Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsParallelpipesVerticalNumber Property
ParameterTypeId Class See Also
---
"Vertical Number for parallel pipes"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsParallelpipesVerticalNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsParallelpipesVerticalNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsParallelpipesVerticalNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace